<template>
	<div>
		<h1 class="white-book-title">《MetaDragon》白皮书</h1>
		<h3>1.元龙</h3>
		<p>有一个神奇的世界，名为“元初”，年轻的创世神用祂最有激情的想象创造了这个世界，因为这是祂创造的第一个世界，所以将其命名为“元初”。在完成了这个作品之后，年轻的神祇满意地离去，任由这个世界自由发展。元初世界汇聚了宇宙中的各种元素精华，在神离去后，这里的生物在宇宙精华的滋养下慢慢演化，终于诞生出了一种身体无比强大，又拥有高深智慧的生物——龙。龙是创世神在元初世界的代言者，是元初世界的守护者，也是创世神脚步的追随者，它们管理着世界上的一切，并且时刻准备追随创世神的脚步，漫游元初之外的世界。</p>
		<h3>2.游戏平台</h3>
		<ul>
			<li>
				个人电脑：
				<ol>
					<li>Intel i3 GHz 或更高。</li>
					<li>3GB RAM 或更大。</li>
					<li>Windows7 或更高版本。</li>
				</ol>
			</li>
			<li>
				移动端
				<ol>
					<li>1.0 GHz处理器。</li>
					<li>2GB RAM 或更大。</li>
					<li>安卓7或更高版本。</li>
				</ol>
			</li>
		</ul>
		<h3>3.龙战士角色</h3>
		<img src="@/assets/whiteBook/1.png" alt="" />
		<ul>
			<li>
				龙：
				<ol>
					<li>《MetaDragon》游戏中可玩的NFT角色称为龙，其具体形态也是龙。</li>
				</ol>
			</li>
			<li>
				属性：
				<ol>
					<li>攻击：龙的攻击能对目标造成伤害，攻击力越高，造成的伤害越高。</li>
					<li>防御：龙的防御能减少目标对自己造成的伤害，防御力越高，目标对自己造成的伤害越少。</li>
					<li>生命：生命值代表龙是否能继续战斗，生命值归零时，龙将被击败并退出战斗。</li>
					<li>魔法：龙使用技能时需要消耗能量，这种能量称为魔法，当魔法值少于使用技能的需求时，龙将不能使用技能。</li>
					<li>资质：资质决定NFT龙的升级成长属性，资质越高加成的属性越多。</li>
					<li>速度：速度决定了龙与怪物的攻击顺序，速度越高，攻击排序就越靠前。</li>
					<li>品质：NFT龙的品质决定了资质的高低，品质越高，资质可能越高。</li>
				</ol>
			</li>
		</ul>
		<h3>4.PVE</h3>
		<img src="@/assets/whiteBook/2.png" />
		<p>PVE玩法是玩家在体验游戏故事情节的同时与不同难度的AI控制的对手作战。</p>
		<p>队长：</p>
		<p>进行探险时时，玩家必须选择一名角色作为队长。</p>
		<p>任务</p>
		<p>每个故事情节都有250个任务，每个任务都是独一无二的。这些任务针对的目标都是AI敌人，因此可以在一段时间内完成，并且某些任务需要玩家先升级他们的龙才能进入。</p>
		<p>奖励</p>
		<p>当玩家在PVE模式下击败对手或赢得战斗时，他们将赢得游戏经验值和LC。完成若干个任务后，玩家将获得特殊奖励。</p>
		<h3>5.日常任务</h3>
		<img src="@/assets/whiteBook/3.png" alt="" />
		<p>玩家每天通过赢得15场PVE，获得30个LC。</p>
		<h3>6.PVP</h3>
		<img src="@/assets/whiteBook/4.png" alt="" />
		<p>在玩家对玩家模式（PVP）中，玩家与其他玩家对战以赚取LC。系统将根据玩家等级和可用性自动分配对手。</p>
		<p>奖励</p>
		<p>玩家每天赢得10场PVP游戏可以获得LB，并且输掉比赛没有代币惩罚。</p>
		<p>PVP（Territory Battle）采用联赛赛制，玩家可以控制自己的龙来挑战其他玩家，玩家每次击败对手都能获得积分。您的积分会根据战斗结果增加或减少，我们将在赛季结束时根据玩家的积分点数进行奖励。</p>
		<p>玩家每次发起挑战，每条龙都需要消耗1点体力，每条龙初始时都有20点体力。</p>
		<p>赛季持续1周，期间玩家可以通过排行榜查看排名和积分，玩家在获得连胜时，积分增加得会更快升级。</p>
		<h3>7.星级</h3>
		<ul>
			<li>龙的品质从零星到五星，共分为六个星级。</li>
			<li>游戏有两种提升龙类星级的方法，即升星和购买。</li>
		</ul>
		<h3>8.升星</h3>
		<ul>
			<li>玩家消耗两条相同星级NFT龙，并消耗一定数量的LC来获得一条高一个星级的NFT龙。</li>
			<li>高星级的龙属性高于低星级的龙，在战斗中它们将拥有巨大优势。</li>
		</ul>
		<h3>9.孵化</h3>
		<img src="@/assets/whiteBook/5.png" alt="" />
		<ul>
			<li>拥有NFT龙后，可以使用LC代币进行孵化产生新的NFT龙</li>
			<li>孵化新的龙游戏内和官网完成。</li>
			<li>玩家必须拥有两个龙并使用LC代币孵化。</li>
			<li>孵化所需的代币数量取决于您的 龙 的孵化数量，数字如下表所示</li>
		</ul>
		<table border="0" cellspacing="0">
			<tr>
				<th>孵化数量</th>
				<th>LC</th>
				<th>孵化天数</th>
			</tr>
			<tr v-for="item in tableData">
				<td class="font-hide">{{ item.num }}</td>
				<td class="font-hide">{{ item.lc }}</td>
				<td class="font-hide">{{ item.day }}</td>
			</tr>
		</table>
		<ul>
			<li>
				孵化
				<ol>
					<li>NFT龙产卵的次数越多，产卵的代币成本就越高。</li>
					<li>最多只能孵化七次</li>
				</ol>
			</li>
		</ul>
		<h3>10.核心战斗玩法</h3>
		<ul>
			<li>每场战斗必须有 3 条龙才能玩</li>
			<li>每场比赛我们有3条龙，最高20点体力。</li>
			<li>会有一个评分系统来评估你的游戏表现。</li>
			<li>你有3条龙打一场比赛，如果战斗结束没有龙阵亡，你可以获得3星评价，每阵亡一条龙评价将会减少1星</li>
		</ul>
		<h3>11.体力</h3>
		<ul>
			<li>每条龙有 20 点体力，每队 3 条 龙有 60 点体力</li>
			<li>每场比赛结束后，龙将失去 1 点体力。</li>
			<li>在 PvE 模式中，只有队长龙失去体力点。</li>
			<li>在 PvP 模式下，所有NFT龙都会减少1点体力点。</li>
			<li>龙将每两小时回复1点体力。</li>
			<li>将龙转移给其他玩家将保留龙的当前的体力值。</li>
		</ul>
		<h3>12.排行榜</h3>
		<ul>
			<li>游戏排行榜根据玩家的成就对游戏中的玩家进行排名。</li>
			<li>排行榜有助于提高玩家之间的竞争力并创造令人兴奋的挑战。每周激励玩家完善他们的技能并获得认可</li>
			<li>
				如何排名
				<ol>
					<li>PvP 战斗结束后，获胜者将获得Rank分，游戏将会根据玩家的Rank分数进行排名</li>
					<li>排名自动重置</li>
					<li>新赛季开始时将重置球员排名（一个赛季持续7天）</li>
				</ol>
			</li>
			<li>
				排名奖励
				<ol>
					<li>赛季结束后，将会根据排名给与优秀玩家LC代币或者其他形式的赛季奖励</li>
				</ol>
			</li>
		</ul>
		<h3>13.游戏中的 NFT</h3>
		<h3>什么是 NFT</h3>
		<ul>
			<li>
				不可替代的代币是资产的数字表示，这些也可以通过代币化来表示物理对象。例如，艺术品或土地契约。不一定具有有形表现的资产，例如虚拟土地或电子游戏中的头像，是 NFT
				的完美应用，因为没有 NFT 与另一个相同，即其品质是独特的、独家的和真实的，这就是为什么数字化令牌集通常用作收藏家的物品
			</li>
		</ul>
		<h3>什么是 NFT 游戏？</h3>
		<ul>
			<li>NFT 游戏基于协作经济，使用区块链技术来验证交易，它们大多是去中心化的，所有参与者都是利益相关者。</li>
			<li>每个游戏都创建了自己的金融生态系统，所有交易以及视频游戏的元素都可以转换为真钱</li>
		</ul>
		<h3>NFT 背后的意识形态</h3>
		<ul>
			<li>
				这就是 NFT
				游戏背后的意识形态，这就是它们如此成功的原因，因为它们彻底改变了人们的看法或玩游戏的方式，因为人们习惯于付费玩游戏而从未在游戏中获得任何回报。传统的电子游戏
			</li>
		</ul>
		<h3>14.收入</h3>
		<ul>
			<li>NFT 游戏是帮助玩家创造额外收入的一种选择，尤其是现在该行业呈指数级增长。</li>
			<li>基于 NFT 区块链的视频游戏已成为委内瑞拉、越南和菲律宾等国家的游戏玩家和公民赚钱的新选择，他们转向他们面临失业或经济发展不足</li>
		</ul>
		<h3>15.应用技术</h3>
		<ul>
			<li>我们使用币安智能链（BSC）作为我们游戏的主干</li>
			<li>什么是币安智能链？</li>
			<li>币安智能链（BSC）可以被描述为与币安链平行的区块链。不同的是BSC具有智能合约功能，兼容以太坊虚拟机（EVM）。这里的目标是在将智能合约引入其生态系统的同时，保持整个币安链的高吞吐量</li>
		</ul>
		<h3>为什么是 BSC？</h3>
		<ul>
			<li>币安智能链（BSC）是一条启用智能合约的高吞吐量区块链，交易费用低至约 0.15 美元</li>
			<li>尽管 BSC 确实提供了快速且廉价的交易，同时保持了安全和可扩展的网络，但网络本身是高度集中的</li>
			<li>在许多方面，BSC 是以太坊的更高性能但中心化的版本。BSC 严重依赖以太坊开发者社区</li>
			<li>总结亮点</li>
			<li>手续费低、安全性更快、兼容性强、高性能、跨链DeFi机制</li>
		</ul>
		<h3>16.经济模型</h3>
		<h3>货币体系</h3>
		<p>游戏中只会产出一种代币</p>
		<p>LC：</p>
		<ul>
			<li>LC可以从 PVE、PVP 和日常任务中获得</li>
			<li>孵化和升级需要 LC</li>
			<li>LC有无限供应</li>
			<li>玩家还可以从任何交易所购买 LC</li>
		</ul>
		<h3>17.收入模式</h3>
		<p>市场</p>
		<ul>
			<li>我们拥有自己专有的NFT市场，供用户买卖NFT表现的游戏内资产</li>
			<li>通过使用我们自己的市场，我们能够绕过像 OpenSea 这样的中介，这使我们能够为用户节省铸造新NFT和相互交换 NFT 的燃料费</li>
		</ul>
		<p>交易费用</p>
		<ul>
			<li>因为我们没有使用中介，所以我们的所有用户都必须使用USDT或者LB代币从我们的市场购买和出售 NFT。</li>
			<li>我们在每笔交易的基础上收取4.5%以促进交易</li>
		</ul>
		<p>为什么收费</p>
		<ul>
			<li>游戏发布后的所有 NFT 都是由我们的用户产生的，这意味着我们不会通过创建和销售新游戏资产来产生收入。</li>
			<li>因此，我们需要收取交易费，以永久资助游戏的运营成本和开发，包括新功能和支持</li>
		</ul>
		<p>代币控股</p>
		<ul>
			<li>我们在运营费用基金中持有 8% 的LB。通过持有 8% 的LB，我们可以利用代币升值价值进一步支持游戏开发和运营</li>
		</ul>
		<p>代币分配</p>
		<ul>
			<li>5%开发者团队 维护
				<ol>
					<li>游戏开发团队更新、维护游戏和技术支持</li>
				</ol>
			</li>
			<li>30%注池swap</li>
			<li>10%社区治理</li>
			<li>35%游戏获取</li>
			<li>20%消耗销毁</li>
		</ul>
	</div>
</template>
<script>
export default {
	props:{
		tableData:{
			type:Array,
			default:()=>[]
		}
	}
};
</script>

